{"content":"\n**Redis** умеет работать с географическими координатами и быстро находить объекты в радиусе от заданной точки, вычислять расстояния между точками и строить простые гео‑запросы. Внутри это реализовано через упорядоченные множества, но команды **GEO*** упрощают работу с координатами.\n\nГеопространственные данные полезны для поиска ближайших ресторанов, расчёта расстояний доставки, отображения объектов на карте и других задач, где важны координаты.\n\n## Добавление точек на карту\n\nКоманда **GEOADD** добавляет точку с координатами в структуру. Координаты задаются как долгота и широта.\n\nПример добавления нескольких точек:\n\n```\nGEOADD restaurants 37.6173 55.7558 \"Cafe Pushkin\"\nGEOADD restaurants 37.6231 55.7520 \"Teremok\"\nGEOADD restaurants 37.6098 55.7525 \"Starbucks\"\n```\n\nЗдесь:\n\n- **restaurants** — имя ключа, где хранятся точки;\n- первое число — долгота (longitude);\n- второе число — широта (latitude);\n- последний аргумент — название или идентификатор точки.\n\nМожно добавить несколько точек за один вызов:\n\n```\nGEOADD restaurants 37.6173 55.7558 \"Cafe Pushkin\" 37.6231 55.7520 \"Teremok\"\n```\n\n## Поиск точек в радиусе\n\nКоманда **GEORADIUS** находит все точки в заданном радиусе от центральной координаты.\n\nПример поиска ресторанов в радиусе 1 километра:\n\n```\nGEORADIUS restaurants 37.6200 55.7550 1 km\n```\n\nЗдесь:\n\n- **37.6200 55.7550** — координаты центра;\n- **1 km** — радиус поиска (можно указать в метрах: **1000 m**).\n\nКоманда вернёт список названий точек, которые попадают в радиус.\n\nЧтобы получить не только названия, но и расстояния до них:\n\n```\nGEORADIUS restaurants 37.6200 55.7550 1 km WITHDIST\n```\n\nОпция **WITHCOORD** вернёт координаты найденных точек:\n\n```\nGEORADIUS restaurants 37.6200 55.7550 1 km WITHCOORD\n```\n\nМожно комбинировать опции:\n\n```\nGEORADIUS restaurants 37.6200 55.7550 1 km WITHDIST WITHCOORD\n```\n\n## Поиск по расстоянию от существующей точки\n\nЕсли нужно найти точки в радиусе от уже известной точки, используют **GEORADIUSBYMEMBER**.\n\nПример: найти все рестораны в радиусе 500 метров от **Cafe Pushkin**:\n\n```\nGEORADIUSBYMEMBER restaurants \"Cafe Pushkin\" 500 m\n```\n\nЭто удобно, когда центральная точка уже есть в структуре и не нужно указывать координаты вручную.\n\n## Вычисление расстояния между точками\n\nКоманда **GEODIST** вычисляет расстояние между двумя точками.\n\nПример:\n\n```\nGEODIST restaurants \"Cafe Pushkin\" \"Teremok\" km\n```\n\nКоманда вернёт расстояние в километрах. Можно указать другие единицы: **m** (метры), **mi** (мили), **ft** (футы).\n\nЕсли одна из точек не найдена, команда вернёт пустое значение.\n\n## Получение координат точки\n\nЧтобы узнать координаты уже добавленной точки, используют **GEOPOS**.\n\nПример:\n\n```\nGEOPOS restaurants \"Cafe Pushkin\"\n```\n\nКоманда вернёт массив координат: сначала долготу, потом широту.\n\n## Хеш для хранения координат\n\nПо умолчанию **GEOADD** хранит координаты в виде геохеша (geohash), который оптимизирован для быстрого поиска. Но можно явно указать, что координаты нужно хранить как обычные значения.\n\nДля большинства задач это не нужно, но если требуется максимальная точность или специфичные запросы, можно работать с координатами напрямую через **ZADD** и геохеши.\n\n## Практические сценарии\n\n**Поиск ближайших объектов.** Приложение для доставки еды находит ближайшие рестораны к адресу клиента.\n\n```\nGEORADIUS restaurants 37.6200 55.7550 2 km WITHDIST\n```\n\n**Расчёт стоимости доставки.** По расстоянию между рестораном и клиентом вычисляется цена доставки.\n\n```\nGEODIST restaurants \"Cafe Pushkin\" \"Client Address\" km\n```\n\n**Отображение на карте.** Все точки в видимой области карты выбираются через **GEORADIUS** с нужным радиусом.\n\n**Поиск по шаблону.** Комбинируя **GEORADIUS** с фильтрацией по другим полям (например, через отдельные ключи), можно строить сложные запросы: «ближайшие рестораны с рейтингом выше 4.5».\n\n## Ограничения и особенности\n\nГеопространственные команды Redis хорошо работают для задач в пределах одного города или региона. Для глобальных запросов (поиск по всей планете) точность может снижаться из‑за особенностей проекции координат.\n\nВажно помнить:\n\n- координаты должны быть в формате WGS84 (стандартный формат GPS);\n- долгота указывается первой, широта — второй (не наоборот);\n- радиус поиска лучше ограничивать разумными значениями (не больше нескольких десятков километров для точных результатов).\n\n## Итого\n\n**Геопространственные команды Redis** позволяют быстро находить объекты по координатам, вычислять расстояния и строить простые гео‑запросы без сложных вычислений на стороне приложения.\n\nДля задач вроде поиска ближайших точек, расчёта расстояний доставки и отображения объектов на карте **GEO*** команды дают удобный и быстрый способ работы с координатами прямо в Redis.\n\n"}