{"content":"\nРежим **RDB** — это периодические снимки состояния Redis на диск. Сервер в какой‑то момент «замораживает» данные и записывает их в бинарный файл **RDB**, чтобы при перезапуске быстро восстановиться до этого состояния.\n\nТакой подход минимально влияет на производительность в обычное время и хорошо подходит для резервного копирования, но при аварии между снимками часть последних изменений может потеряться.\n\n## Как работает RDB на практике\n\nRedis сохраняет снимок либо по расписанию, либо по явной команде. Внутри используется механизм **BGSAVE**: сервер делает fork процесса, и дочерний процесс пишет данные в RDB‑файл, пока основной продолжает принимать команды.\n\nПосмотреть текущие настройки сохранения:\n\n```\nCONFIG GET save\nCONFIG GET dbfilename\nCONFIG GET dir\n```\n\nПример типичной конфигурации:\n\n```\nsave 900 1\nsave 300 10\nsave 60 10000\ndbfilename dump.rdb\ndir /var/lib/redis\n```\n\nЭто значит, что Redis создаст snapshot, если за 900 секунд произошёл хотя бы 1 апдейт, или за 300 секунд — 10 апдейтов, или за 60 секунд — 10000 апдейтов.\n\n## Ручное создание snapshot\n\nИногда нужно сделать снимок «по требованию», например перед обновлением приложения.\n\nСинхронное сохранение (блокирует сервер):\n\n```\nSAVE\n```\n\nАсинхронное сохранение (рекомендуется для продакшена):\n\n```\nBGSAVE\n```\n\nПосле **BGSAVE** в каталоге **dir** появится обновлённый **dump.rdb**. Этот файл можно:\n\n- скопировать на удалённый сервер как резервную копию;\n- использовать для поднятия тестового окружения;\n- хранить в бэкап‑хранилище вместе с другими бэкапами.\n\n## Что происходит при перезапуске\n\nКогда Redis стартует и находит в каталоге **dump.rdb**, он:\n\n1. Загружает данные из RDB в память.\n2. Начинает принимать команды, как обычно.\n\nВсе изменения, сделанные после последнего snapshot, будут потеряны. Если, например, RDB создавался раз в 5 минут, а сервер упал через 4 минуты после сохранения, эти 4 минуты операций не восстановятся.\n\nПоэтому RDB воспринимают как вариант «периодической» персистентности, где допускается небольшой временной лаг в данных.\n\n## Когда RDB уместен, а когда нет\n\nRDB хорошо подходит для:\n\n- резервного копирования состояния Redis;\n- сценариев, где допустима потеря части последних данных;\n- относительно спокойных по записи систем, где snapshot не слишком нагружает диск и память.\n\nRDB хуже подходит, когда:\n\n- важна почти нулевая потеря данных при сбое;\n- нагрузка на запись высокая, и частые snapshot создают заметную нагрузку;\n- Redis используется как основной источник финансовых или других критичных данных.\n\nВ таких случаях RDB часто комбинируют с **AOF** или включают отдельные механизмы репликации и бэкапов.\n\n## Итог\n\nRDB — это простой и быстрый способ периодически сохранять состояние Redis на диск в одном бинарном файле.\n\nЭтот режим почти не мешает производительности в обычной работе и удобен для бэкапов, но всегда нужно помнить, что между снимками часть недавних операций может быть потеряна при аварийном перезапуске.\n\n\n"}