{"content":"\nРежим **AOF** (Append Only File) записывает каждую команду изменения данных в журнал на диск. При перезапуске Redis читает этот журнал и «проигрывает» команды заново, восстанавливая состояние почти до момента сбоя.\n\nЗа счёт этого AOF даёт более надёжную персистентность, чем одни только RDB‑снимки, но требует аккуратных настроек и периодической перепаковки файла.\n\n## Как устроен AOF\n\nКогда AOF включён, Redis:\n\n1. При каждом изменении данных дописывает команду в AOF‑файл.\n2. Периодически «сбрасывает» буфер на диск в зависимости от настроек синхронизации.\n3. В фоне может переписывать файл, убирая из него лишние старые команды.\n\nОсновные настройки можно посмотреть так:\n\n```\nCONFIG GET appendonly\nCONFIG GET appendfilename\nCONFIG GET appendfsync\n```\n\nЕсли **appendonly** равен yes, то режим AOF включён. Имя файла по умолчанию — **appendonly.aof**.\n\n## Настройка частоты fsync\n\nКлючевой параметр, влияющий на надёжность и производительность, — **appendfsync**. Он определяет, как часто Redis будет вызывать fsync для записи данных на диск.\n\nВарианты:\n\n```\nCONFIG SET appendfsync always\nCONFIG SET appendfsync everysec\nCONFIG SET appendfsync no\n```\n\nСмысл:\n\n- **always** — fsync после каждой команды. Максимальная надёжность, но может сильно замедлить запись.\n- **everysec** — fsync раз в секунду. Компромисс: в худшем случае теряется около секунды данных.\n- **no** — Redis полагается на буферы ОС. Быстро, но потеря последних изменений при сбое может быть больше.\n\nНа практике чаще всего выбирают **everysec** как баланс между безопасностью и скоростью.\n\n## Включение AOF на живом инстансе\n\nЕсли AOF был выключен, его можно включить без остановки сервера:\n\n```\nCONFIG SET appendonly yes\n```\n\nRedis:\n\n1. Создаст начальный AOF‑файл на основе текущего состояния (под капотом использует RDB + преобразование в набор команд).\n2. Начнёт дописывать новые команды в файл.\n\nЭтот процесс может занять время и временно увеличить нагрузку на диск и память, поэтому включать AOF лучше в спокойный период.\n\n## Перепаковка AOF (AOF rewrite)\n\nСо временем AOF‑файл растёт, потому что в нём остаются старые команды, которые много раз перезаписывали одни и те же ключи. Чтобы файл не раздувался бесконечно, Redis умеет переписывать его в компактный вариант.\n\nЯвный запуск перепаковки:\n\n```\nBGREWRITEAOF\n```\n\nRedis:\n\n1. Создаёт новый временный AOF‑файл с «сжатым» набором команд.\n2. В момент переключения аккуратно заменяет старый файл новым.\n\nТипичный пример:\n\n- старый файл содержит множество SET одного и того же ключа;\n- новый файл будет содержать только один последний SET, который даёт то же итоговое состояние.\n\nПерепаковка может запускаться автоматически при росте файла, если настроены соответствующие параметры в конфиге.\n\n## Когда AOF уместен\n\nРежим AOF хорошо подходит, когда:\n\n- важна минимальная потеря данных при сбое;\n- Redis хранит критичную бизнес‑информацию, а не только кэш;\n- нужно иметь детальный журнал операций для отладки или анализа.\n\nНужно учитывать:\n\n- AOF создаёт дополнительную нагрузку на диск;\n- при некорректных настройках appendfsync запись может стать узким местом;\n- при очень высоких нагрузках на запись иногда используют отдельные инстансы под AOF и под кэш.\n\nЧасто AOF комбинируют с RDB, чтобы ускорить запуск и иметь два независимых источника восстановления.\n\n## Итог\n\n**AOF** превращает Redis в систему с почти непрерывной персистентностью: каждая команда записывается в журнал и может быть воспроизведена после перезапуска.\n\nГрамотный выбор режима **appendfsync**, регулярная перепаковка AOF‑файла и понимание нагрузок на диск позволяют использовать этот механизм без ощутимого удара по производительности.\n\n\n"}