{"content":"\nПо умолчанию **Redis** настроен скорее для доверенной среды: локальная разработка, внутренняя сеть, отсутствие прямого доступа из интернета. В продакшене такой подход опасен — сервер может стать открытым для всех, кто видит его порт.\n\nНачинать защиту Redis стоит с трёх вещей: сетевые ограничения, базовая аутентификация и отключение лишних команд в уязвимой среде.\n\n## Сетевые ограничения: bind и protected-mode\n\nПервый слой — не давать лишнего сетевого доступа к Redis.\n\nТипичная безопасная настройка:\n\n```\nbind 127.0.0.1\nprotected-mode yes\nport 6379\n```\n\nСмысл:\n\n- bind 127.0.0.1 — принимать подключения только с локальной машины;\n- protected-mode yes — включён защищённый режим, который запрещает опасные операции при подозрительной конфигурации.\n\nЕсли нужно принимать подключения по сети, лучше явно указать адрес внутреннего интерфейса и защитить доступ firewall, VPN или отдельным уровнем прокси:\n\n```\nbind 10.0.0.10\nprotected-mode yes\n```\n\nОткрывать Redis напрямую в интернет почти никогда не нужно и очень рискованно.\n\n## Пароль и команда AUTH\n\nДаже во внутренней сети стоит включить аутентификацию.\n\nВ конфиге:\n\n```\nrequirepass \"strong-password\"\n```\n\nПосле этого любой клиент должен сначала аутентифицироваться:\n\n```\nAUTH strong-password\nSET cache:page:/ \"...\"\n```\n\nПростые правила:\n\n- использовать длинный случайный пароль;\n- не хранить пароль в открытом виде в репозиториях;\n- передавать пароль в переменных окружения или менеджере секретов.\n\nЕсли требуется несколько ролей с разными правами, лучше использовать ACL, о которых пойдёт речь отдельно.\n\n## Отключение опасных команд\n\nНа некоторых окружениях имеет смысл отключить команды, которые позволяют вызывать shell или управлять модулями.\n\nПримеры:\n\n```\nrename-command FLUSHALL \"\"\nrename-command FLUSHDB \"\"\nrename-command CONFIG \"\"\nrename-command SHUTDOWN \"\"\n```\n\nПустая строка в качестве нового имени фактически отключает команду. Это не защита от всего, но позволяет случайно не стереть данные через FLUSHALL или не дать внешнему пользователю крутить CONFIG.\n\nВажные моменты:\n\n- такие настройки нужно хорошо документировать для команды;\n- инструменты администрирования Redis должны учитывать, что некоторые команды переименованы или отключены.\n\n## Итог\n\nБазовая защита **Redis** — это в первую очередь про сетевую изоляцию, включённый protected-mode, адекватный bind и обязательную аутентификацию.\n\nЕсли с самого начала ограничить доступ к серверу и отключить самые опасные команды в продакшене, риск случайных и умышленных проблем с безопасностью резко снижается даже до внедрения более сложных механизмов.\n\n\n"}