{"content":"\nПароль на весь Redis — это минимум. В более сложных системах хочется давать разным сервисам разные права: одним только чтение, другим ограниченный набор команд, третьим полный доступ. Для этого в **Redis** есть **ACL** — списки контроля доступа.\n\nИдея проста: создаём пользователей с разными правами, выдаём каждому свои учётные данные и описываем, что им можно.\n\n## Просмотр и базовые команды ACL\n\nПосмотреть текущих пользователей:\n\n```\nACL LIST\n```\n\nПолучить информацию о конкретном пользователе:\n\n```\nACL GETUSER default\n```\n\nСоздать нового пользователя и выдать ему права:\n\n```\nACL SETUSER app-reader on >strong-pass ~* +GET +MGET +INFO\n```\n\nРазбор:\n\n- on — включить пользователя;\n- >strong-pass — задать пароль;\n- ~* — разрешить доступ ко всем ключам (ограничения по шаблонам разберём ниже);\n- +GET +MGET +INFO — список разрешённых команд.\n\nПосле этого клиент может аутентифицироваться как app-reader:\n\n```\nAUTH app-reader strong-pass\nGET cache:article:42\n```\n\n## Ограничения по ключам\n\nКроме команд, можно ограничивать доступ по шаблонам ключей.\n\nПример: сервис, который должен видеть только свои ключи сессий.\n\nСоздадим пользователя:\n\n```\nACL SETUSER session-service on >session-pass ~session:* +GET +SET +DEL\n```\n\nЗдесь:\n\n- ~session:* — разрешён доступ только к ключам, начинающимся с session:;\n- +GET +SET +DEL — можно читать, записывать и удалять свои сессии.\n\nЕсли такой пользователь попробует обратиться к cache:article:42, Redis вернёт ошибку доступа.\n\n## Разделение ролей по сервисам\n\nПрактичный подход — завести отдельных пользователей под разные типы сервисов:\n\n- для фоновых задач — право на чтение и запись очередей и кэша;\n- для публичного API — ограниченный набор чтений и безопасных записей;\n- для административных инструментов — расширенный набор команд.\n\nПримеры:\n\nСервис кэша:\n\n```\nACL SETUSER cache-service on >cache-pass ~cache:* +GET +SET +DEL +EXPIRE\n```\n\nСервис метрик:\n\n```\nACL SETUSER metrics-service on >metrics-pass ~metrics:* +INCR +GET +MGET\n```\n\nАдмин:\n\n```\nACL SETUSER admin on >admin-pass allcommands allkeys\n```\n\nТакой расклад позволяет, даже при утечке одного пароля, сильно ограничить ущерб.\n\n## Итог\n\nACL в **Redis** позволяют задать тонкую модель доступа: какие команды доступны, к каким ключам можно обращаться и под какими учётными данными работает каждый сервис.\n\nЕсли для разных частей системы завести отдельных пользователей с минимально необходимыми правами, даже компрометация одной учётной записи не даст злоумышленнику полный контроль над всей базой.\n\n\n"}