{"content":"\nДаже при правильных паролях и ACL Redis остаётся уязвимым, если его можно перехватить по сети: трафик без шифрования легко читать и подменять. Поэтому в продакшене важно одновременно ограничить сеть и, при необходимости, включить **TLS**.\n\nПрактически это сводится к трём шагам: изоляция по сети, защита порта Redis и настройка шифрования.\n\n## Изоляция по сети\n\nПервая линия защиты — не выпускать Redis в открытый мир.\n\nТипичные приёмы:\n\n- помещать Redis в приватную подсеть;\n- разрешать к нему доступ только с адресов приложений;\n- закрывать внешний порт на уровне firewall.\n\nПример грубой, но показательной настройки firewall на сервере:\n\n```\niptables -A INPUT -p tcp --dport 6379 -s 10.0.0.0/24 -j ACCEPT\niptables -A INPUT -p tcp --dport 6379 -j DROP\n```\n\nЗдесь 6379 открыт только для подсети 10.0.0.0/24. Остальные подключения режутся ещё до попадания в Redis.\n\nВ оркестраторах вроде Kubernetes те же правила реализуются через NetworkPolicy и настройки сервисов.\n\n## Включение TLS на стороне Redis\n\nНачиная с современных версий, Redis умеет принимать TLS‑подключения напрямую.\n\nВ конфиге:\n\n```\nport 0\ntls-port 6379\n\ntls-cert-file /etc/redis/tls/redis.crt\ntls-key-file /etc/redis/tls/redis.key\ntls-ca-cert-file /etc/redis/tls/ca.crt\n```\n\nЗдесь:\n\n- port 0 — отключаем нешифрованный порт;\n- tls-port 6379 — включаем порт только под TLS;\n- tls-cert-file, tls-key-file, tls-ca-cert-file — путь к сертификату, ключу и корневому сертификату.\n\nПосле этого клиенты должны подключаться с поддержкой TLS:\n\n```\nredis-cli -h my-redis-host -p 6379 --tls \\\n  --cert /etc/redis/tls/client.crt \\\n  --key /etc/redis/tls/client.key \\\n  --cacert /etc/redis/tls/ca.crt\n```\n\nВ бою сертификаты обычно выдаются через корпоративный PKI или автоматизированные системы вроде cert-manager.\n\n## TLS через прокси\n\nЕсли по каким‑то причинам нет возможности собрать Redis с поддержкой TLS, можно использовать внешний прокси.\n\nИдея:\n\n- Redis слушает только на локальном адресе без TLS;\n- снаружи доступен только прокси (например, stunnel, Envoy, Nginx‑стрим), который принимает TLS и прокидывает трафик внутрь.\n\nСхема:\n\n- приложение → TLS → прокси → plain‑TCP → Redis.\n\nПлюсы:\n\n- не нужно трогать конфиг Redis;\n- проще унифицировать шифрование для нескольких сервисов;\n- сертификатами управляет один слой.\n\nМинусы:\n\n- дополнительный компонент в инфраструктуре;\n- важно следить за его отказоустойчивостью и масштабированием.\n\n## Итог\n\nСетевая безопасность в **Redis** начинается с изоляции по сети и правильного bind, а завершается шифрованием трафика через TLS либо на самом Redis, либо через внешний прокси.\n\nЕсли не выпускать порт Redis в интернет, ограничивать список клиентов и шифровать соединения между датацентрами и внешними сервисами, риск перехвата и подмены данных заметно снижается.\n\n\n"}