{"content":"\nПомимо защиты доступа к самому Redis, важно подумать о том, что происходит с данными на диске и в бэкапах. Если RDB‑ и AOF‑файлы лежат в открытом виде, их кража может быть не менее опасна, чем прямой доступ к серверу.\n\nЗадача — сделать так, чтобы потеря диска или бэкапного хранилища не означала автоматическую утечку всех пользовательских данных.\n\n## Где лежат файлы Redis\n\nСначала нужно чётко понимать, где именно находятся данные Redis.\n\nПосмотреть настройки:\n\n```\nCONFIG GET dir\nCONFIG GET dbfilename\nCONFIG GET appendfilename\n```\n\nТипичный ответ:\n\n```\ndir /var/lib/redis\ndbfilename dump.rdb\nappendfilename appendonly.aof\n```\n\nЭто означает, что:\n\n- snapshot RDB лежит в /var/lib/redis/dump.rdb;\n- журнал AOF — в /var/lib/redis/appendonly.aof.\n\nИменно эти файлы нужно включать в зону повышенной защиты: права доступа, мониторинг, шифрование диска.\n\n## Права доступа и изоляция на сервере\n\nМинимальные меры:\n\n- запускать Redis под отдельным пользователем (например, redis);\n- ограничить доступ к каталогу данных:\n\n```\nchown -R redis:redis /var/lib/redis\nchmod 700 /var/lib/redis\n```\n\nТак только пользователь redis будет иметь прямой доступ к файлам RDB и AOF. Остальные пользователи системы не смогут просто так их прочитать.\n\nВ контейнерных и облачных окружениях аналогичные ограничения задаются через политики безопасности и права на volume.\n\n## Шифрование диска и бэкапов\n\nЧтобы кража диска или snapshot в облаке не привела к мгновенной утечке, стоит использовать шифрование:\n\n- на уровне файловой системы (LUKS, BitLocker, eCryptfs и аналоги);\n- на уровне облачного диска (встроенное шифрование в облаке);\n- на уровне бэкапного хранилища (S3‑совместимые хранилища с включённым encryption at rest).\n\nАлгоритм простой:\n\n1. Включить шифрование для дисков, где лежит каталог Redis.\n2. Включить шифрование для хранилища бэкапов.\n3. Следить, чтобы ключи шифрования хранились отдельно от данных и были защищены.\n\nТак даже физическая кража диска не позволит прочитать содержимое без доступа к ключам.\n\n## Чувствительные данные в Redis\n\nОтдельный вопрос — какие именно данные вы кладёте в Redis.\n\nПрактика:\n\n- по возможности избегать хранения «голых» персональных данных (ФИО, адреса, документы);\n- для особо чувствительных полей использовать шифрование на уровне приложения и хранить в Redis уже зашифрованные значения;\n- не кэшировать в Redis то, что нельзя безопасно восстановить или аннулировать.\n\nПример:\n\nвместо хранения телефона как есть:\n\n```\nSET user:42:phone \"+123456789\"\n```\n\nприложение может хранить зашифрованную строку, а ключи шифрования держать отдельно, например в KMS:\n\n```\nSET user:42:phone \"ENC:.....\"\n```\n\nДаже если кто‑то прочитает dump.rdb, расшифровать содержимое без доступа к KMS будет значительно сложнее.\n\n## Итог\n\nБезопасность данных в **Redis** — это не только пароли и ACL, но и защита RDB/AOF‑файлов, дисков и бэкапов, а также осознанный подход к тому, какие данные и в каком виде мы туда кладём.\n\nЕсли ограничить права доступа к файлам, шифровать хранилища и не хранить в Redis лишнюю чувствительную информацию в открытом виде, последствия утечки или кражи инфраструктуры будут гораздо менее критичными.\n\n\n"}