{"content":"\nБольшинство проблем безопасности с **Redis** возникают не из‑за сложных уязвимостей, а из‑за простых ошибок в конфигурации. Сервер оказывается доступен из интернета, пароли лежат в репозитории, а дампы данных никто не защищает.\n\nНиже — короткий список типичных промахов и способов их избежать.\n\n## Открытый Redis в интернет\n\nКлассическая ошибка — поднять Redis с bind 0.0.0.0 и без firewall.\n\nПример опасной конфигурации:\n\n```\nbind 0.0.0.0\nprotected-mode no\nrequirepass \"\"\n```\n\nТакой сервер становится добычей для автоматических сканеров: любой, кто найдёт порт 6379, может выполнять команды, читать и стирать данные.\n\nКак правильно:\n\n- не публиковать Redis напрямую в интернет;\n- использовать приватные сети, VPN и firewall;\n- включать protected-mode и аккуратно настраивать bind.\n\n## Отсутствие аутентификации и ACL\n\nЕщё одна частая проблема — отсутствие пароля и единый доступ ко всему Redis.\n\nОшибочный подход:\n\n- rely только на «внутреннюю сеть»;\n- использовать один пароль для всего и всех сервисов.\n\nЛучше:\n\n- всегда задавать requirepass или ACL;\n- создавать отдельных пользователей для разных сервисов;\n- выдавать каждому минимально необходимый набор команд и ключей.\n\n## Пароли и конфиги в репозитории\n\nДаже при хорошей настройке Redis можно всё испортить, если положить пароли и ключи в git.\n\nТипичный антипример:\n\n- redis.conf с реальными паролями в репозитории;\n- docker-compose.yml с открытыми секретами;\n- README с реальными командами AUTH.\n\nЛучше:\n\n- хранить секреты в менеджерах вроде Vault или встроенных секрета‑хранилищах облака;\n- передавать пароли через переменные окружения или отдельные файлы, не попадающие в git;\n- использовать шаблоны конфигураций с подстановкой секретов на этапе деплоя.\n\n## Незащещённые дампы и бэкапы\n\nДаже если сам Redis хорошо спрятан, RDB/AOF‑файлы и бэкапы часто лежат без шифрования и с широкими правами доступа.\n\nОшибки:\n\n- каталоги с dump.rdb и appendonly.aof доступны всем пользователям на сервере;\n- бэкапы в облаке не шифруются;\n- доступ к бэкапному хранилищу не ограничен.\n\nЧто делать:\n\n- ограничить права на каталог данных Redis;\n- включить шифрование дисков и хранилищ бэкапов;\n- регулярно проверять, кто имеет доступ к этим данным.\n\n## Игнорирование обновлений\n\nRedis активно развивается, и вместе с новыми фичами выходят исправления безопасности. Оставлять продакшен на старой версии на годы вперёд — рискованно.\n\nПрактичные шаги:\n\n- следить за релизами Redis и changelog;\n- периодически обновлять версию на стендах и в продакшене;\n- иметь простой процесс отката на прошлую версию в случае проблем.\n\n## Итог\n\nТипичные ошибки безопасности в **Redis** почти всегда связаны с простыми вещами: неправильный bind, отсутствие аутентификации, открытые в репозитории пароли и незащищённые бэкапы.\n\nЕсли осознанно пройтись по этим пунктам и привести конфигурацию в порядок, уровень защиты Redis заметно вырастет, не усложняя архитектуру и не требуя экзотических решений.\n\n\n"}