{"content":"\nRate limiting — это ограничение числа операций за промежуток времени. Чаще всего его используют, чтобы защитить API, формы логина и другие чувствительные точки от злоупотреблений.\n\nИдея простая: считать события (запросы, попытки входа) и не давать делать их слишком часто.\n\n## Простой лимит: не больше N запросов за окно\n\nКлассический пример: не больше 10 запросов в минуту с одного пользователя или IP.\n\nВ качестве ключа можно взять что‑то вроде:\n\n```\nrate:login:ip:127.0.0.1\n```\n\nКаждый запрос увеличивает счётчик и задаёт срок жизни ключа:\n\n```\nINCR rate:login:ip:127.0.0.1\nEXPIRE rate:login:ip:127.0.0.1 60\n```\n\nЛогика в приложении:\n\n1. Увеличить счётчик через INCR.\n2. Если это первый запрос (ответ 1) — задать время жизни через EXPIRE.\n3. Если значение счётчика больше порога (например, 10) — вернуть ошибку «слишком много запросов».\n\nТак получается простое «окно» на 60 секунд: после паузы счётчик сам обнуляется.\n\n## Болеe ровный лимит: скользящее окно на ZSET\n\nФиксированное окно иногда даёт «скачки»: пользователь может сделать почти 2× лимита на границе минут. Чтобы сгладить это, используют скользящее окно на упорядоченном множестве.\n\nКлюч для пользователя:\n\n```\nrate:api:user:42\n```\n\nПри каждом запросе берём текущий timestamp (например, в миллисекундах) и выполняем последовательность команд:\n\n1. Добавить метку времени в ZSET.\n2. Удалить из ZSET все записи старше окна (например, старше 60 секунд).\n3. Посчитать, сколько записей осталось.\n\nПример команд:\n\n```\nZADD rate:api:user:42 1710000000000 \"req1\"\nZREMRANGEBYSCORE rate:api:user:42 -inf 1709999940000\nZCARD rate:api:user:42\n```\n\nЕсли ZCARD показывает, что запросов больше лимита, новый запрос отклоняется.\n\n**Плюсы такого подхода:** более честное ограничение «N запросов за последние X секунд», а не за календарную минуту.\n\n## Что именно ограничивать\n\nВ качестве части ключа для лимита можно использовать:\n\n- идентификатор пользователя;\n- IP‑адрес;\n- комбинацию метода и пути API;\n- любое другое значение, которое нужно защитить.\n\nПримеры ключей:\n\n```\nrate:api:user:42\nrate:api:ip:10.0.0.1\nrate:login:user:42\n```\n\nГлавное — чтобы по ключу было понятно, что именно вы ограничиваете.\n\n## Итого\n\n**Rate limiting на Redis** сводится к двум идеям:\n\n- простой счётчик с TTL для грубого лимита «N запросов за окно»;\n- упорядоченное множество с метками времени для более ровного скользящего окна.\n\nДальше всё зависит от логики приложения: где именно вы добавляете запрос в счётчик и как обрабатываете ситуацию, когда лимит превышен.\n"}