{"content":"\nPub/Sub в Redis — это способ отправлять сообщения сразу многим получателям. Один отправитель публикует событие в канал, а все подписчики этого канала получают его почти мгновенно.\n\nЭтот механизм удобен для чатов, уведомлений, сигналов между сервисами и любых ситуаций, где важно «рассказать всем, кто слушает, что что‑то произошло».\n\n## Основная идея\n\nЕсть три участника:\n\n**Канал.** Имя, по которому объединяются отправители и получатели. Например, news:sport.\n\n**Подписчик.** Клиент, который говорит Redis: «хочу получать всё из этого канала».\n\n**Публикатор.** Клиент или сервис, который отправляет сообщения в каналы.\n\nВажно: Pub/Sub не хранит историю. Сообщение видят только те, кто был подписан в момент отправки.\n\n## Простой пример\n\nОдин клиент подписывается на канал:\n\n```\nSUBSCRIBE news:sport\n```\n\nТеперь всё, что придёт в канал news:sport, сразу попадёт этому клиенту.\n\nДругой клиент публикует сообщение:\n\n```\nPUBLISH news:sport \"Гол на 90-й минуте\"\n```\n\nПодписчик увидит это сообщение мгновенно. Если в этот канал подписано несколько клиентов, все они получат один и тот же текст.\n\nЧтобы перестать слушать канал, можно отписаться:\n\n```\nUNSUBSCRIBE news:sport\n```\n\n## Шаблоны каналов\n\nЕсли нужно слушать сразу много каналов, удобно использовать шаблоны.\n\nПодписка по шаблону:\n\n```\nPSUBSCRIBE news:*\n```\n\nТак клиент получит сообщения из всех каналов, которые начинаются с news:. Например, news:sport, news:it, news:world.\n\nОтписка от шаблонов:\n\n```\nPUNSUBSCRIBE news:*\n```\n\n## Пример: уведомления для пользователей\n\nПусть у каждого пользователя есть свой канал уведомлений.\n\nСхема ключей для каналов:\n\n```\nnotifications:user:42\nnotifications:user:100\n```\n\nКлиент пользователя 42 подписывается на свой канал:\n\n```\nSUBSCRIBE notifications:user:42\n```\n\nКогда в системе что‑то происходит (новое сообщение, лайк, комментарий), сервер отправляет событие в нужный канал:\n\n```\nPUBLISH notifications:user:42 \"Новое сообщение в чате\"\n```\n\nКлиент сразу получает уведомление и может показать его в интерфейсе.\n\n## Когда Pub/Sub подходит, а когда нет\n\nPub/Sub хорошо работает, когда:\n\n**Нужна онлайн‑доставка.** Важны только те, кто сейчас подключён.\n\n**Сообщения одноразовые.** Не нужно хранить историю.\n\n**Много слушателей.** Одно сообщение сразу получает несколько клиентов.\n\nPub/Sub плохо подходит, когда:\n\n**Сообщения нельзя терять.** Если получатель отключился, событие ему не придёт.\n\n**Нужна история событий.** Нельзя «догнать» старые сообщения после переподключения.\n\nВ таких случаях лучше смотреть в сторону Streams или очередей задач.\n\n## Итого\n\nPub/Sub в Redis — простой способ делать вещание событий: отправитель публикует сообщение в канал, все подписчики получают его сразу. Никакой истории, только живой поток. Для чатов, сигналов между сервисами и онлайн‑уведомлений этого часто достаточно, особенно на ранних этапах проекта.\n"}