{"content":"\nХранение сессий в Redis позволяет быстро проверять, авторизован ли пользователь, и не нагружать основную базу лишними запросами. Сессия связывает случайный токен с информацией о пользователе и временем жизни.\n\n## Зачем хранить сессии в Redis\n\n**Redis** хорошо подходит для сессий, потому что:\n\n**Быстро.** Проверка токена — это один запрос к памяти.\n\n**Есть TTL.** Срок действия сессии задаётся автоматически и не требует ручной очистки.\n\n**Удобно масштабировать.** Несколько экземпляров приложения могут работать с одним Redis и видеть одни и те же сессии.\n\n## Простая схема сессии\n\nОбычно сессия выглядит так:\n\n- у пользователя есть случайный токен, который хранится в cookie или заголовке;\n- по этому токену в Redis лежит информация о пользователе.\n\nПример ключа для сессии:\n\n```\nsession:token:abc123\n```\n\nВнутри можно хранить:\n\n- идентификатор пользователя (**user_id**);\n- нужные флаги (например, **is_admin**);\n- время создания, если требуется.\n\nВ Redis это можно записать строкой (JSON) или хешем. Простейший вариант со строкой и временем жизни 30 минут:\n\n```\nSETEX session:token:abc123 1800 \"{\\\"user_id\\\":42}\"\n```\n\n## Создание сессии при логине\n\nПоследовательность шагов при успешном входе:\n\n1. Проверить логин и пароль в основной базе.\n2. Сгенерировать случайный токен.\n3. Сохранить сессию в Redis с TTL.\n4. Отдать токен клиенту.\n\nПример записи сессии в виде хеша:\n\n```\nHSET session:token:abc123 user_id 42\nEXPIRE session:token:abc123 1800\n```\n\nКлиент получает токен **abc123** и отправляет его с каждым запросом (через cookie или заголовок).\n\n## Проверка сессии при запросе\n\nНа каждом запросе сервер:\n\n1. Достаёт токен из cookie или заголовка.\n2. Проверяет, есть ли такая сессия в Redis.\n3. Если сессия найдена — считает пользователя авторизованным.\n\nПример проверки:\n\n```\nHGET session:token:abc123 user_id\n```\n\nЕсли Redis вернул значение, можно считать, что пользователь вошёл. Если пусто — сессия истекла или никогда не существовала.\n\nИногда при каждом запросе с TTL делают «продление» сессии:\n\n```\nEXPIRE session:token:abc123 1800\n```\n\nТак время жизни сдвигается вперёд, пока пользователь активен.\n\n## Выход из аккаунта\n\nПри выходе из аккаунта достаточно удалить запись о сессии:\n\n```\nDEL session:token:abc123\n```\n\nПосле этого токен больше не будет найден, и следующий запрос с этим токеном будет считаться неавторизованным.\n\nЕсли у пользователя много одновременных сессий (несколько устройств), можно делать ключи вида:\n\n```\nsession:user:42:device:phone\nsession:user:42:device:laptop\n```\n\nИ удалять только нужную сессию или сразу все, если требуется принудительный выход везде.\n\n## Итого\n\n**Сессии в Redis** — это связка «токен → данные пользователя с TTL». Приложение быстро проверяет токен, не ходит лишний раз в основную базу и может гибко управлять сроком жизни авторизации.\n\n"}