{"content":"\n\nСчётчики и метрики в Redis используют, чтобы быстро понимать, что происходит в системе: сколько раз нажали кнопку, сколько было логинов, просмотров страниц, ошибок и так далее. Всё держится на простых операциях инкремента.\n\n## Простые счётчики\n\nБазовый вариант — общий счётчик события. Например, сколько всего раз пользователи вошли в систему.\n\nУвеличить счётчик:\n\n```\nINCR metrics:logins\n```\n\nПрочитать текущее значение:\n\n```\nGET metrics:logins\n```\n\nКоманда **INCR** создаст ключ, если его ещё нет, и начнёт отсчёт с 1.\n\nАналогично можно считать клики по кнопке или отправки формы:\n\n```\nINCR metrics:click:buy\nINCR metrics:form:feedback:submit\n```\n\n## Счётчики по дням\n\nЧтобы не просто знать общий итог, а видеть статистику по времени, в ключ добавляют дату.\n\nНапример, логины по дням:\n\n```\nINCR metrics:logins:2025-11-21\n```\n\nПросмотры страницы:\n\n```\nINCR metrics:views:article:42:2025-11-21\n```\n\nТак легко построить график: приложение или аналитика просто считывают значения по датам.\n\nИногда у таких ключей задают время жизни, чтобы старая статистика не висела вечно:\n\n```\nEXPIRE metrics:views:article:42:2025-11-21 2592000\n```\n\nЗдесь данные удалятся через 30 дней.\n\n## Несколько метрик в одном ключе\n\nЕсли метрик много, удобно собирать их в один хеш.\n\nПример общего хеша по системе:\n\n```\nHINCRBY metrics:global logins 1\nHINCRBY metrics:global registrations 1\nHINCRBY metrics:global errors 1\n```\n\nПрочитать все значения сразу:\n\n```\nHGETALL metrics:global\n```\n\nТак можно быстро получить набор ключевых показателей без обхода десятков отдельных ключей.\n\n## Уникальные значения и HyperLogLog\n\nОбычный счётчик показывает количество событий, но не количество уникальных пользователей. Для приблизительного подсчёта уникальных значений в Redis есть **HyperLogLog**.\n\nДобавить пользователя в структуру:\n\n```\nPFADD metrics:uv:2025-11-21 user_42\n```\n\nПолучить оценку числа уникальных пользователей за день:\n\n```\nPFCOUNT metrics:uv:2025-11-21\n```\n\nЭто даёт быстрый и компактный способ считать уникальных посетителей, клиенты, сессии и другие объекты, которых может быть очень много.\n\n## Сброс и чтение показателей\n\nЕсли нужно обнулить счётчик, его просто удаляют:\n\n```\nDEL metrics:logins\n```\n\nИли сбрасывают только отдельное поле в хеше, записав нужное значение через **HSET**.\n\nДля сбора метрик приложение обычно:\n\n- увеличивает счётчики там, где происходят события;\n- периодически читает значения и отправляет их в систему мониторинга или отчётов.\n\n## Итого\n\nСчётчики и метрики в Redis строятся вокруг нескольких команд: **INCR**, **HINCRBY**, **PFADD**, **PFCOUNT**. С их помощью можно считать события, разрезать статистику по дням, хранить несколько показателей в одном ключе и оценивать количество уникальных пользователей без тяжёлых запросов к основной базе."}