{"content":"\nДля нормальной эксплуатации **Redis** важно не только писать и читать данные, но и понимать, как чувствует себя сервер: хватает ли памяти, не зашкаливает ли число подключений, нет ли проблем с репликацией. Базовый инструмент для этого — команда **INFO**.\n\nЧерез INFO можно быстро посмотреть ключевые метрики и на их основе настроить мониторинг в Prometheus, Grafana и других системах.\n\n## Команда INFO по разделам\n\nВ самом простом виде:\n\n```\nINFO\n```\n\nRedis вернёт большой блок текста, разбитый на разделы: Server, Clients, Memory, Persistence, Stats, Replication и так далее.\n\nМожно запрашивать конкретный раздел:\n\n```\nINFO memory\nINFO stats\nINFO replication\n```\n\nЭто удобнее для автоматического сбора метрик и для быстрой диагностики проблем в конкретной области.\n\n## Важные метрики памяти\n\nРаздел **memory** помогает оценить, сколько ресурсов реально съедает Redis.\n\nПример:\n\n```\nINFO memory\n```\n\nКлючевые поля:\n\n- used_memory — сколько памяти реально занято под данные и структуры Redis;\n- used_memory_rss — сколько памяти занят процесс в системе (с учётом фрагментации);\n- maxmemory — лимит памяти, если он настроен;\n- mem_fragmentation_ratio — отношение RSS к used_memory, показывает уровень фрагментации.\n\nНа практике:\n\n- если used_memory близко к maxmemory, скоро начнут работать политики вытеснения;\n- если mem_fragmentation_ratio сильно больше 1, есть смысл расследовать фрагментацию и настройки аллокатора.\n\n## Общие статистики и нагрузка\n\nРаздел **stats** даёт представление о том, насколько активно используется Redis.\n\nПример:\n\n```\nINFO stats\n```\n\nПолезные поля:\n\n- total_commands_processed — сколько команд всего обработано;\n- instantaneous_ops_per_sec — текущий QPS (команды в секунду);\n- keyspace_hits и keyspace_misses — попадания и промахи по ключам;\n- expired_keys — сколько ключей было удалено по TTL.\n\nЭти метрики хорошо подходят:\n\n- для графиков нагрузки во времени;\n- для понимания эффективности кэша (по hit/miss);\n- для оценки того, сколько ключей реально живёт за счёт TTL.\n\n## Клиенты и соединения\n\nРаздел **clients** помогает увидеть, сколько подключений открыто и нет ли «утечек» клиентов.\n\nПример:\n\n```\nINFO clients\n```\n\nСмотрим:\n\n- connected_clients — число активных соединений;\n- blocked_clients — сколько клиентов сейчас заблокировано (например, на BLPOP или командах, ожидающих данных).\n\nЕсли connected_clients растёт без остановки или часто достигает лимитов, стоит:\n\n- проверить, правильно ли приложения закрывают подключения;\n- настроить пулы соединений;\n- при необходимости увеличить лимиты и ресурсы.\n\n## Итог\n\nКоманда **INFO** — центральный инструмент быстрой диагностики и базового мониторинга Redis: через неё можно увидеть память, нагрузку, клиентов и состояние репликации.\n\nЕсли регулярно смотреть на ключевые поля и вытащить их в систему мониторинга, многие проблемы с Redis становятся заметны задолго до того, как превратятся в реальные аварии.\n\n\n"}