{"content":"\nКогда Redis начинает «тормозить», важно понять, какие именно команды его грузят: кто шлёт слишком тяжёлые запросы, какие операции работают медленно и почему. Для этого в Redis есть две мощные вещи: **MONITOR** для живого просмотра команд и **SLOWLOG** для истории медленных операций.\n\nЭти инструменты удобно использовать в паре: MONITOR — для оперативной отладки, SLOWLOG — для системного анализа.\n\n## MONITOR — живой поток команд\n\nКоманда **MONITOR** показывает все команды, которые выполняются на сервере, в режиме реального времени.\n\nПример:\n\n```\nMONITOR\n```\n\nПосле этого клиент начнёт получать строки вида:\n\n```\n1669212345.123456 [0 10.0.0.5:53421] \"SET\" \"user:42\" \"Alice\"\n1669212345.234567 [0 10.0.0.6:53422] \"GET\" \"cache:article:42\"\n```\n\nЧто это даёт:\n\n- видно, какие ключи активно используются;\n- можно отследить, какие сервисы шлют неожиданные команды;\n- удобно в отладке на тестовой среде.\n\nВажно:\n\n- MONITOR сильно нагружает сервер и сеть, особенно под высокой нагрузкой;\n- его не стоит использовать постоянно в продакшене;\n- лучше подключаться к MONITOR с отдельного, временного клиента и на ограниченное время.\n\n## SLOWLOG — журнал медленных команд\n\n**SLOWLOG** хранит записи о командах, которые выполнялись дольше заданного порога.\n\nПосмотреть текущие настройки:\n\n```\nCONFIG GET slowlog-log-slower-than\nCONFIG GET slowlog-max-len\n```\n\nТипичные значения:\n\n- slowlog-log-slower-than — порог в микросекундах (например, 10000 = 10 мс);\n- slowlog-max-len — сколько записей хранить в журнале.\n\nПример настройки:\n\n```\nCONFIG SET slowlog-log-slower-than 10000\nCONFIG SET slowlog-max-len 128\n```\n\nПросмотр журнала:\n\n```\nSLOWLOG GET 10\n```\n\nОтвет содержит:\n\n- идентификатор записи;\n- время выполнения;\n- саму команду и её аргументы.\n\nТак можно увидеть, какие конкретные запросы стабильно занимают десятки или сотни миллисекунд.\n\n## Как использовать эти инструменты на практике\n\nТиповой сценарий:\n\n1. В продакшене всегда включён разумный SLOWLOG (порог в районе 5–10 мс).\n2. При первых жалобах на тормоза смотрим SLOWLOG и ищем паттерны:\n\n```\nSLOWLOG GET 20\n```\n\n3. Если нужно понять, откуда точно приходят проблемные команды, временно включаем MONITOR на тесте или на отдельной реплике.\n4. По результатам:\n\n- оптимизируем ключи и команды;\n- пересматриваем использование тяжёлых операций (например, KEYS, большие LRANGE, массовые скрипты).\n\n## Итог\n\n**MONITOR** даёт живую картинку всех команд, а **SLOWLOG** — аккуратный список самых медленных операций за последнее время.\n\nЕсли держать SLOWLOG настроенным постоянно и подключать MONITOR точечно для сложных случаев, отладка производительности Redis превращается из угадывания в понятный и воспроизводимый процесс.\n\n\n"}