{"content":"\nКогда Redis начинает упираться в лимит памяти или отдельные ключи вызывают всплески нагрузки, важно уметь быстро понять, кто именно виноват. Для этого пригодятся команды **MEMORY** и инструменты вроде **LATENCY DOCTOR**, а также аккуратный обход ключей.\n\nЧасть этих приёмов уже встречалась в разделе про управление памятью, здесь посмотрим на них с точки зрения мониторинга и быстрой диагностики.\n\n## Быстрая оценка памяти через INFO и MEMORY STATS\n\nПервый шаг — посмотреть общую картину:\n\n```\nINFO memory\n```\n\nЕсли used_memory близок к maxmemory или mem_fragmentation_ratio заметно больше 1, стоит копнуть глубже.\n\nБолее детальный снимок:\n\n```\nMEMORY STATS\n```\n\nКоманда возвращает массив статистик: сколько памяти уходит на данные, на служебные структуры, на аллокатор. Эти данные удобно загонять в мониторинг, чтобы отслеживать тренды роста и понимать, где именно «толстеет» Redis.\n\n## Поиск тяжёлых ключей через MEMORY USAGE\n\nЧтобы найти, какие ключи занимают больше всего памяти, можно пройтись по ним через SCAN и для каждого замерить размер.\n\nПример ручного подхода:\n\n```\nSCAN 0 MATCH cache:* COUNT 100\nMEMORY USAGE cache:article:1\nMEMORY USAGE cache:article:2\n```\n\nНа практике:\n\n- скрипт на стороне приложения обходит ключи по SCAN;\n- вызывает **MEMORY USAGE** для каждого;\n- строит топ‑N самых тяжёлых ключей.\n\nТак легко обнаружить:\n\n- слишком крупные JSON‑значения;\n- ключи без TTL, которые накопили огромные структуры;\n- неожиданные коллекции логов и очередей.\n\n## Поиск горячих ключей через мониторинг\n\nГорячие ключи — это те, к которым идёт непропорционально много обращений. Они могут становиться узким местом: один ключ с тяжёлым значением, который читают тысячи раз в секунду.\n\nПростейший приём:\n\n- временно включить **MONITOR** на тестовой реплике или в ограниченное время;\n- отфильтровать поток команд по ключам и посчитать частоту обращений.\n\nПример:\n\n```\nMONITOR\n```\n\nДальше парсер или отдельный инструмент считает, какие ключи встречаются чаще всего. Такие ключи:\n\n- кандидаты на оптимизацию структуры данных;\n- могут требовать кэширования на стороне приложения;\n- иногда подсказка, что данные стоит разнести по нескольким ключам.\n\n## LATENCY DOCTOR и неожиданные задержки\n\nRedis имеет встроенный инструмент для анализа задержек:\n\n```\nLATENCY DOCTOR\n```\n\nОн пытается автоматически найти и описать проблемы:\n\n- длительные блокирующие операции;\n- резкие скачки в работе диска;\n- аномалии в репликации.\n\nВывод команды даёт текстовые рекомендации и может указать, где искать корень проблемы — в памяти, диске, сети или конкретных командах.\n\n## Итог\n\nДиагностика памяти и горячих ключей в **Redis** опирается на INFO и MEMORY STATS для общей картины, MEMORY USAGE и SCAN для поиска тяжёлых ключей, а также MONITOR и LATENCY DOCTOR для анализа частоты обращений и задержек.\n\nЕсли держать под рукой эти инструменты и периодически смотреть на них не только во время аварий, многие проблемы с памятью и узкими местами можно поймать и исправить заранее.\n\n\n"}