{"content":"\nКогда Redis «медленный», реальная причина почти всегда одна из нескольких: крупные блокирующие команды, неподходящие структуры данных, проблемы с диском (snapshot, AOF), перегруженный сетью или CPU сервер. Хорошая новость — эти ситуации повторяются из проекта в проект, и для них есть устойчивые приёмы диагностики.\n\nРазберём несколько типичных симптомов и шаги, которые помогают быстро сузить поиск.\n\n## Высокая задержка ответов\n\nСимптом: время ответа Redis скачет, иногда подскакивает до десятков и сотен миллисекунд.\n\nЧто проверить:\n\n1. Общую картину:\n\n```\nINFO stats\nINFO clients\nLATENCY DOCTOR\n```\n\n2. SLOWLOG:\n\n```\nSLOWLOG GET 20\n```\n\nЕсли в SLOWLOG видно команды вроде:\n\n- большие LRANGE на сотни тысяч элементов;\n- KEYS с широкими шаблонами;\n- тяжёлые Lua‑скрипты;\n\nто это первые кандидаты на оптимизацию.\n\n## Просадки из‑за snapshot и AOF\n\nСимптом: периодические пики задержек и нагрузки на диск, совпадающие с BGSAVE или BGREWRITEAOF.\n\nЧто смотреть:\n\n```\nINFO persistence\n```\n\nПолезные поля:\n\n- rdb_last_bgsave_status и rdb_last_bgsave_time_sec;\n- aof_last_bgrewrite_status и aof_last_bgrewrite_time_sec.\n\nЕсли длительность фоновых операций велика, а в логах часто видны запуск BGSAVE/BGREWRITEAOF, стоит:\n\n- уменьшить частоту snapshot;\n- убедиться, что диск достаточно быстрый;\n- по возможности выносить Redis и тяжёлые дисковые операции на разные устройства.\n\n## Перегруженный одним узлом кластер\n\nВ кластере возможна ситуация, когда одна нода обрабатывает непропорционально много запросов.\n\nПроверить:\n\n```\nCLUSTER NODES\nINFO stats\n```\n\nЕсли один мастер показывает значительно больший instantaneous_ops_per_sec и used_memory, чем остальные, возможно:\n\n- распределение слотов неравномерно;\n- hash tags ведут слишком много ключей на одну ноду.\n\nРешения:\n\n- перераспределить слоты через redis-cli --cluster reshard;\n- пересмотреть схему ключей и использование hash tags.\n\n## Застрявшие или блокирующие клиенты\n\nСимптом: растёт число blocked_clients, часть команд «висят».\n\nПроверить:\n\n```\nINFO clients\nCLIENT LIST\n```\n\nblocked_clients > 0 говорит, что есть операции, ожидающие данных (BLPOP, BRPOP, XREAD с BLOCK), или другие блокировки.\n\nНужно:\n\n- убедиться, что продюсеры действительно пишут в очереди;\n- проверить, нет ли ситуаций, когда потребители забывают подтверждать сообщения в Streams и переполняют PEL;\n- при необходимости ограничить время блокировки и предусмотреть таймауты на стороне приложения.\n\n## Итог\n\nТипичные проблемы производительности в **Redis** почти всегда сводятся к тяжёлым командам, неудачной конфигурации персистентности или неравномерному распределению нагрузки.\n\nЕсли использовать INFO, SLOWLOG, LATENCY DOCTOR, CLIENT LIST и, при необходимости, команды кластера, диагностика превращается в понятный набор шагов, а не в хаотичный поиск вслепую.\n\n\n"}