{"content":"\n**Репликация** в Redis позволяет копировать данные с одного узла на один или несколько реплик. Основной узел принимает записи, а реплики получают поток изменений и поддерживают у себя почти такое же состояние. Это нужно для отказоустойчивости и разгрузки чтения.\n\nБазовая идея: есть один ведущий сервер, который принимает все изменения, и несколько ведомых, которые синхронно или с небольшой задержкой подтягивают данные.\n\n## Роль master и replica\n\nВ простейшем варианте конфигурации есть:\n\n- один основной узел, который принимает команды записи;\n- несколько реплик, которые получают данные только от master.\n\nПосмотреть роли можно через:\n\n```\nINFO replication\n```\n\nНа master вывод будет содержать примерно такое:\n\n```\nrole:master\nconnected_slaves:1\nslave0:ip=10.0.0.2,port=6379,state=online,offset=12345,lag=0\n```\n\nНа реплике:\n\n```\nrole:slave\nmaster_host:10.0.0.1\nmaster_port:6379\nmaster_link_status:up\n```\n\nПо умолчанию реплики работают только на чтение. Это защищает от случайных изменений данных на нескольких узлах и упрощает логику приложения: все записи идут в один master.\n\n## Односторонний поток данных\n\nРепликация в Redis всегда идёт в одну сторону: replica копирует состояние с master, но не наоборот.\n\nПри первом подключении реплика:\n\n1. Запрашивает полную синхронизацию.\n2. Получает snapshot данных от master.\n3. Применяет к себе этот snapshot.\n4. Дальше принимает поток новых команд и применяет их по мере прихода.\n\nЕсли соединение временно обрывается, Redis пытается сделать частичную синхронизацию, используя журнал смещений, чтобы не пересылать всю базу заново. Но в простом понимании важно помнить: master считается источником правды, а replica — копией.\n\n## Зачем нужна репликация\n\nРепликация решает сразу несколько задач:\n\n- распределение нагрузки по чтению — запросы могут идти на реплики;\n- резервная копия данных в реальном времени;\n- подготовка площадки для быстрого переключения в случае сбоя master.\n\nТипичные сценарии:\n\n- выделить master для записи, а отчётные запросы и тяжёлые чтения отправлять на реплики;\n- держать одну replica в другом датацентре для аварийного восстановления;\n- использовать набор master и нескольких replica как основу для автоматического failover через Sentinel или кластер.\n\n## Итог\n\nРепликация в **Redis** строится вокруг простой модели master–replica: один узел принимает изменения, остальные получают от него поток данных и поддерживают актуальное состояние.\n\nТакой подход помогает масштабировать чтение и повышать отказоустойчивость, не усложняя приложение сложной логикой записи на несколько узлов одновременно.\n\n\n"}