{"content":"\nНастроить схему master–replica в Redis можно двумя способами: через конфигурационные файлы при запуске или через команды во время работы сервера. В обоих случаях идея одна и та же — указать реплике, у какого master она должна забирать данные.\n\nРазберём минимальную конфигурацию и практические команды, которые пригодятся в разработке и продакшене.\n\n## Базовая конфигурация через redis.conf\n\nПредставим, что у нас два сервера:\n\n- основной: **10.0.0.1:6379**;\n- реплика: **10.0.0.2:6379**.\n\nНа master конфигурация может быть минимальной:\n\n```\nbind 0.0.0.0\nport 6379\n```\n\nНа реплике достаточно указать, откуда брать данные:\n\n```\nbind 0.0.0.0\nport 6379\n\nreplicaof 10.0.0.1 6379\n```\n\nПосле запуска:\n\n- master принимает все записи;\n- replica подключается к master, делает полную синхронизацию и дальше подтягивает изменения.\n\nПроверить роли можно командой:\n\n```\nINFO replication\n```\n\nНа реплике важно держать включённым режим только для чтения, чтобы случайно не писать в неё напрямую:\n\n```\nreplica-read-only yes\n```\n\n## Настройка через команды во время работы\n\nИногда удобнее настраивать репликацию «на лету» без перезапуска.\n\nПусть Redis уже запущен на обоих серверах. Тогда на реплике достаточно выполнить:\n\n```\nREPLICAOF 10.0.0.1 6379\n```\n\nС этого момента узел станет replica указанного master. Если позднее нужно вернуть его к одиночному режиму:\n\n```\nREPLICAOF NO ONE\n```\n\nЭта команда отключает репликацию, и узел снова становится самостоятельным master с теми данными, которые у него есть.\n\nПолезно проверять текущую роль:\n\n```\nROLE\n```\n\nОтвет покажет, является ли сервер master, replica и какие есть соединения.\n\n## Настройка доступа и безопасности\n\nЕсли на master включена авторизация, реплика должна знать пароль, чтобы подключиться.\n\nНа master:\n\n```\nrequirepass \"strong-master-password\"\n```\n\nНа реплике:\n\n```\nmasterauth \"strong-master-password\"\nreplicaof 10.0.0.1 6379\n```\n\nВ новых версиях можно использовать ACL и более гибкие правила, но базовая идея остаётся той же: реплика аутентифицируется к master и после этого начинает получать данные.\n\nВажно:\n\n- не использовать один и тот же Redis для разных окружений (dev, stage, prod);\n- ограничивать доступ по сети к портам Redis;\n- следить, чтобы реплика не «убежала» синхронизироваться с неправильным master.\n\n## Итог\n\nНастройка master–replica в **Redis** сводится к простым шагам: указать реплике адрес master, проверить роли и, при необходимости, настроить авторизацию.\n\nДальше Redis сам берёт на себя полную и частичную синхронизацию, а задача разработчика — правильно встроить эту схему в инфраструктуру и не писать напрямую в реплики.\n\n\n"}