{"content":"\nRedis — отличный инструмент для многих задач, но он не универсален. Есть ситуации, где его использование будет неэффективным, рискованным или просто неправильным выбором. Понимание ограничений помогает избежать проблем и выбрать подходящий инструмент с самого начала.\n\n## Когда данные должны быть строго персистентными\n\nRedis хранит данные в памяти. Хотя есть механизмы сохранения на диск (RDB и AOF), они не гарантируют нулевую потерю данных при сбое. Между снимками или записями в лог возможна потеря последних изменений.\n\n**Не используйте Redis, если:**\n\n- потеря даже нескольких секунд данных критична (финансовые транзакции, медицинские записи);\n- требуется строгая гарантия ACID с немедленной записью на диск;\n- данные должны быть надёжно сохранены даже при внезапном отключении питания.\n\n**Лучше выбрать:** PostgreSQL, MySQL, другие реляционные БД с гарантиями персистентности.\n\n## Когда нужны сложные запросы и связи\n\nRedis — это хранилище «ключ–значение» с простыми структурами данных. Здесь нет JOIN, сложных фильтров, агрегаций, полнотекстового поиска по содержимому.\n\n**Не используйте Redis, если:**\n\n- нужно делать запросы вроде «найти всех пользователей из города X, которые купили товар Y за последний месяц»;\n- важны связи между сущностями (один ко многим, многие ко многим);\n- требуется сложная аналитика с группировками и вычислениями.\n\n**Лучше выбрать:** PostgreSQL для реляционных данных, MongoDB для документной модели, Elasticsearch для поиска и аналитики.\n\n## Когда данных больше, чем доступной памяти\n\nRedis держит все данные в оперативной памяти. Если объём данных превышает доступную RAM, Redis либо начнёт вытеснять ключи (если настроена политика eviction), либо перестанет принимать записи.\n\n**Не используйте Redis, если:**\n\n- нужно хранить терабайты данных, а доступной памяти недостаточно;\n- данные редко используются, но должны быть доступны (архивы, старые логи);\n- стоимость RAM становится неподъёмной для объёма данных.\n\n**Лучше выбрать:** PostgreSQL, MongoDB, Cassandra — системы, которые умеют работать с диском и эффективно использовать память как кэш.\n\n## Когда нужны транзакции с изоляцией\n\nВ Redis есть команды MULTI/EXEC, но они не дают полной изоляции транзакций, как в реляционных БД. Нет блокировок на уровне строк, нет уровней изоляции, нет автоматического отката при конфликтах.\n\n**Не используйте Redis, если:**\n\n- критичны транзакции с гарантией изоляции (например, перевод денег между счетами);\n- нужно предотвратить чтение «грязных» данных во время транзакции;\n- важна консистентность при одновременных изменениях нескольких связанных сущностей.\n\n**Лучше выбрать:** PostgreSQL, MySQL с поддержкой транзакций и уровнями изоляции.\n\n## Когда нужна репликация с записью на несколько узлов\n\nRedis поддерживает репликацию, но запись идёт только на master. Реплики работают в режиме только чтения. Нет встроенной поддержки multi-master репликации, где можно писать на любой узел.\n\n**Не используйте Redis, если:**\n\n- нужна запись на несколько узлов одновременно с автоматической синхронизацией;\n- важна географическая распределённость с записью в разных регионах;\n- требуется сложная схема репликации с конфликт-резолюцией.\n\n**Лучше выбрать:** Cassandra, MongoDB с multi-master, распределённые системы с поддержкой записи на несколько узлов.\n\n## Когда нужны большие значения или сложные структуры\n\nХотя Redis поддерживает разные структуры данных, работа с очень большими значениями (мегабайты и больше) может быть неэффективной. Большие операции блокируют сервер и замедляют работу других клиентов.\n\n**Не используйте Redis, если:**\n\n- нужно хранить большие файлы, изображения, видео;\n- значения регулярно превышают несколько мегабайт;\n- важна эффективная работа с большими бинарными данными.\n\n**Лучше выбрать:** объектные хранилища (S3, MinIO), файловые системы, специализированные хранилища для больших данных.\n\n## Когда нужна строгая безопасность и аудит\n\nRedis изначально создавался для доверенных сред. Хотя есть механизмы безопасности (ACL, TLS), они не так развиты, как в специализированных БД.\n\n**Не используйте Redis, если:**\n\n- требуется детальный аудит всех операций с данными;\n- нужны строгие политики доступа на уровне строк или полей;\n- важна соответствие строгим стандартам безопасности (HIPAA, PCI-DSS) без дополнительных слоёв.\n\n**Лучше выбрать:** PostgreSQL с расширениями для аудита, специализированные БД с встроенными механизмами безопасности.\n\n## Когда нагрузка в основном на запись\n\nRedis оптимизирован для быстрого чтения. При очень высокой нагрузке на запись (десятки тысяч записей в секунду с большими значениями) может возникнуть узкое место, особенно если включена персистентность.\n\n**Не используйте Redis, если:**\n\n- основная нагрузка — запись больших объёмов данных (логирование, метрики);\n- нужна эффективная запись на диск без влияния на производительность;\n- важнее пропускная способность записи, чем скорость чтения.\n\n**Лучше выбрать:** специализированные системы для логов (Kafka, ClickHouse), временные ряды БД (InfluxDB, TimescaleDB).\n\n## Итого\n\n**Redis — отличный выбор для кэширования, сессий, счётчиков, очередей и быстрого доступа к данным в памяти.** Но он не заменяет реляционные БД для сложных запросов, не подходит для строгих транзакций и не справляется с данными, которые не помещаются в память.\n\nГлавное правило: **используйте Redis там, где важна скорость доступа к данным в памяти, а не там, где нужны сложные запросы, строгая персистентность или огромные объёмы данных.** Правильный выбор инструмента зависит от конкретных требований задачи, а не от популярности технологии.\n\n"}