{"content":"\nDocker — это клиент-серверное приложение. Когда вы набираете команды в терминале, происходит больше, чем кажется на первый взгляд. Разберем основные компоненты системы.\n\n## Основные компоненты\n\n### 1. Docker Client (Клиент)\nЭто то, с чем вы взаимодействуете. Утилита командной строки `docker`.\nКогда вы пишете `docker build` или `docker run`, клиент отправляет эти команды демону Docker. Клиент может работать на той же машине, что и демон, или подключаться к удаленному серверу.\n\n### 2. Docker Daemon (Демон, `dockerd`)\nЭто «мозг» и «руки» Docker. Он работает в фоне на хост-машине.\nИменно демон выполняет всю тяжелую работу:\n- Создает и удаляет контейнеры.\n- Скачивает и собирает образы.\n- Управляет сетями и хранилищами данных.\n\n### 3. Docker Registry (Реестр)\nЭто хранилище образов. Самый известный публичный реестр — **Docker Hub**.\nКогда вы просите запустить программу, которой у вас нет локально, демон идет в реестр, скачивает нужный образ и запускает его. Компании часто поднимают свои приватные реестры (например, GitLab Registry) для хранения закрытого кода.\n\n## Ключевые объекты\n\nВ работе с Docker вы постоянно оперируете тремя сущностями:\n\n### Image (Образ)\nЭто **шаблон**, чертеж. Образ доступен только для чтения (read-only). В нем запаковано приложение, код, библиотеки, переменные среды — всё, что нужно для запуска.\nАналогия: Образ — это **класс** в программировании.\n\n### Container (Контейнер)\nЭто **запущенный экземпляр** образа. У него появляется свой слой для записи данных. Контейнеры можно создавать, запускать, останавливать и удалять.\nАналогия: Контейнер — это **объект** (экземпляр класса). Из одного образа можно запустить хоть 100 контейнеров.\n\n### Volume (Том)\nТак как контейнеры эфемерны (при удалении контейнера все данные внутри него пропадают), для хранения важных данных (базы данных, логи, файлы пользователей) используются **Volumes**. Это специальные папки, которые хранятся на хост-машине и «пробрасываются» внутрь контейнера.\n\n## Как это работает вместе\n\nПример команды:\n```bash\ndocker run -d nginx\n```\n\nЧто происходит \"под капотом\":\n1. **Client** получает команду `run` и передает её демону.\n2. **Daemon** проверяет, есть ли у вас локально образ `nginx`.\n3. Если нет — он идет в **Registry** (Docker Hub), скачивает образ `nginx` себе в кэш.\n4. Из этого **Image** демон создает новый **Container**.\n5. Демон запускает контейнер и выделяет ему ресурсы.\n\n## Итого\n\nВы управляете Docker через **Client**, который отдает приказы **Daemon**. Демон скачивает **Images** из **Registry** и превращает их в живые **Containers**. Понимание этой цепочки помогает быстрее находить проблемы, когда что-то идет не так.\n\n"}