{"content":"\n**Redis Sentinel** — это отдельный компонент, который следит за master и репликами, замечает сбои и при необходимости сам переключает роль на одну из реплик. Можно считать его «наблюдателем» и «аварийным переключателем» для Redis.\n\nГлавная цель Sentinel — убрать ручной failover и сделать так, чтобы приложение всегда знало, куда писать, даже если один из узлов упал.\n\n## Что делает Sentinel\n\nSentinel выполняет сразу несколько задач:\n\n- мониторит состояние master и replica;\n- решает, когда master считается недоступным;\n- выбирает подходящую реплику и продвигает её в новый master;\n- сообщает клиентам, где сейчас активный master.\n\nСписок наблюдаемых узлов и параметры порогов задаются в конфиге Sentinel.\n\n## Минимальная конфигурация Sentinel\n\nSentinel — это отдельный процесс Redis, запущенный в специальном режиме.\n\nПример простого конфига для одного мастера:\n\n```\nport 26379\n\nsentinel monitor mymaster 10.0.0.1 6379 2\nsentinel down-after-milliseconds mymaster 5000\nsentinel parallel-syncs mymaster 1\nsentinel failover-timeout mymaster 60000\n```\n\nЗдесь:\n\n- **mymaster** — имя наблюдаемого кластера Redis;\n- **10.0.0.1 6379** — адрес master;\n- **2** — сколько Sentinel должно согласиться, чтобы признать master мёртвым;\n- **down-after-milliseconds** — через сколько миллисекунд без ответа считать master недоступным;\n- **parallel-syncs** — сколько реплик можно одновременно пересинхронизировать после failover;\n- **failover-timeout** — окно времени, в котором должен уложиться процесс переключения.\n\nОбычно запускают минимум три экземпляра Sentinel, чтобы решения принимались большинством.\n\n## Как клиенты узнают о новом master\n\nSentinel сам меняет роли узлов, но приложение должно знать, куда теперь отправлять записи.\n\nЕсть два основных подхода:\n\n- клиенты, умеющие работать с Sentinel (драйверы для Redis), сами запрашивают у него адрес актуального master;\n- дополнительный слой (прокси, сервис‑дискавери) использует информацию Sentinel, чтобы отдавать клиентам правильный адрес.\n\nПример запроса из клиента к Sentinel для получения адреса master:\n\n```\nSENTINEL get-master-addr-by-name mymaster\n```\n\nОтветом будет текущий host и port активного master.\n\n## Итог\n\n**Redis Sentinel** добавляет к репликации слой наблюдения и автоматического переключения: он следит за узлами, решает, что master недоступен, и продвигает реплику в новую роль.\n\nПри правильно настроенных порогах и нескольких экземплярах Sentinel можно избавиться от ручного failover и сделать Redis заметно более устойчивым к сбоям отдельных серверов.\n\n\n"}