{"content":"\nАвтоматическое переключение (failover) в связке Redis + Sentinel означает, что при падении master система сама выбирает новую реплику и делает её основным узлом. Задача приложения — уметь быстро узнать новый адрес и продолжить работу без ручного вмешательства.\n\nРазберём, как выглядит процесс failover шаг за шагом и какие настройки влияют на его поведение.\n\n## Как Sentinel принимает решение о failover\n\nSentinel периодически пингует master и реплики. Когда master не отвечает дольше заданного порога, начинается процедура выбора нового master.\n\nКлючевые параметры:\n\n```\nsentinel down-after-milliseconds mymaster 5000\nsentinel failover-timeout mymaster 60000\nsentinel parallel-syncs mymaster 1\n```\n\nСмысл:\n\n- **down-after-milliseconds** — сколько миллисекунд без ответа считать master недоступным;\n- **failover-timeout** — общее окно для проведения failover;\n- **parallel-syncs** — сколько реплик можно одновременно пересинхронизировать с новым master.\n\nРешение о том, что master действительно мёртв (not reachable), принимается большинством Sentinel. Поэтому обычно поднимают минимум три экземпляра на разных серверах.\n\n## Процесс автоматического переключения\n\nКогда quorum Sentinel согласился, что master недоступен, начинается failover:\n\n1. Из доступных реплик выбирается кандидат в новый master (учитываются задержка, отставание, приоритет).\n2. Кандидату посылается команда стать самостоятельным master:\n\n```\nREPLICAOF NO ONE\n```\n\n3. Остальным репликам указывают новый master:\n\n```\nREPLICAOF <ip-нового-master> 6379\n```\n\n4. Информация о новом master публикуется через Sentinel, и клиенты, которые умеют с ним общаться, получают обновлённый адрес.\n\nВесь этот процесс занимает от нескольких секунд до десятков секунд, в зависимости от настроек и качества сети.\n\n## Как клиенты находят новый master\n\nКлиенты, поддерживающие Sentinel, обычно:\n\n1. Подключаются к набору Sentinel (например, по трём адресам).\n2. Запрашивают у него координаты master по имени:\n\n```\nSENTINEL get-master-addr-by-name mymaster\n```\n\n3. Подключаются к полученному адресу и используют его для команд записи.\n4. При ошибках подключения к Redis снова идут к Sentinel за обновлённым адресом.\n\nЕсли драйвер Redis в вашем языке не умеет работать с Sentinel, это можно обернуть отдельным слоем (прокси, сервис‑дискавери), который сам следит за Sentinel и отдаёт клиентам актуальный endpoint.\n\n## Типичные грабли при автоматическом переключении\n\nНа практике проблемы чаще всего связаны не с самим Sentinel, а с окружением:\n\n- слишком маленький **down-after-milliseconds** — частые ложные срабатывания при временных задержках сети;\n- клиенты закэшировали старый адрес master и не ходят к Sentinel за новым;\n- DNS или балансировщик не обновляют конфигурацию после failover;\n- реплики отстают слишком сильно, и новый master поднимается с устаревшими данными.\n\nПоэтому важно:\n\n- тестировать сценарии failover на тестовой среде;\n- проверять, как реальные клиенты узнают о новом master;\n- мониторить отставание реплик и время проведения failover.\n\n## Итог\n\nАвтоматическое переключение с помощью **Redis Sentinel** позволяет переживать падение master без ручного вмешательства: система сама выбирает реплику, продвигает её в master и перенастраивает остальные узлы.\n\nЕсли клиенты правильно интегрированы с Sentinel и настройки порогов подобраны под реальную сеть, Redis становится заметно устойчивее к сбоям отдельных серверов и кратковременным проблемам с инфраструктурой.\n\n\n"}