{"content":"\n**Redis Cluster** — это режим работы, в котором данные автоматически распределяются по нескольким узлам (шартам), а внутри каждого шарда всё ещё может быть master и реплики. Задача кластера — одновременно дать масштабирование по объёму данных и по нагрузке, сохраняя при этом отказоустойчивость.\n\nВ отличие от схемы «один master + несколько реплик», Redis Cluster умеет сам решать, на какой узел положить ключ, и как перенаправить клиента, если он обратился не туда.\n\n## Базовая идея кластера\n\nВ кластере Redis есть:\n\n- несколько master‑узлов, каждый хранит свою часть ключей;\n- опционально — реплики у каждого master для высокой доступности;\n- специальный механизм распределения ключей по **16384 слотам**.\n\nКаждый ключ попадает в один из 16384 хэш‑слотов по хешу:\n\n```\nhash_slot = CRC16(key) mod 16384\n```\n\nКаждый слот закреплён за конкретным master. Если мастер уходит из строя, и у него есть реплика, кластер может автоматически переключить слот на реплику.\n\n## Минимальная конфигурация кластера\n\nДля запуска кластера нужно несколько инстансов Redis с включённым режимом cluster.\n\nЧасть настроек в redis.conf:\n\n```\nport 6379\ncluster-enabled yes\ncluster-config-file nodes.conf\ncluster-node-timeout 5000\n```\n\nПосле запуска нескольких таких инстансов их объединяют в кластер с помощью утилиты:\n\n```\nredis-cli --cluster create \\\n  10.0.0.1:6379 10.0.0.2:6379 10.0.0.3:6379 \\\n  --cluster-replicas 1\n```\n\nФлаг **--cluster-replicas 1** говорит, что для каждого master будет создана одна реплика. В итоге получится набор мастер‑реплика пар, между которыми распределены все 16384 слота.\n\n## Маршрутизация запросов и редиректы\n\nКлиент кластера может попасть не на тот мастер, который хранит нужный ключ. В этом случае Redis отвечает редиректом:\n\n- **MOVED** — ключ живёт на другом узле, и этот слот уже закреплён за ним;\n- **ASK** — временный редирект во время переноса слотов между узлами.\n\nПример:\n\n```\nSET user:42 \"Alice\"\n```\n\nЕсли запрос пришёл не на тот узел, клиент получит ответ вида:\n\n```\nMOVED 12539 10.0.0.2:6379\n```\n\nДальше драйвер Redis, умеющий работать с кластером, сам перенаправит запрос на правильный узел и обновит у себя карту слотов.\n\n## Когда Redis Cluster уместен\n\nКластер имеет смысл, когда:\n\n- данных становится слишком много для одного сервера (по памяти или по диску);\n- нагрузка на один инстанс Redis превышает комфортный предел;\n- нужно горизонтально масштабировать чтение и запись по нескольким узлам.\n\nВажно помнить:\n\n- в режиме кластера не все команды доступны в прежнем виде (особенно мульти‑ключевые);\n- транзакции и Lua‑скрипты должны работать с ключами из одного слота;\n- есть свои особенности при миграции данных и смене топологии.\n\nДля сценариев, где достаточно одного узла с репликами, кластер может быть излишне сложным. Но для крупных систем с ростом данных это стандартный путь масштабирования Redis.\n\n## Итог\n\n**Redis Cluster** распределяет ключи по нескольким master‑узлам, добавляя к репликации автоматический шардинг и встроенный механизм отказоустойчивости.\n\nЕсли драйверы клиентов умеют работать с кластером, а ограничения по командам приняты в расчёт, кластер позволяет плавно наращивать объём данных и обрабатывать всё более высокую нагрузку без единой точки отказа.\n\n\n"}