{"content":"\nНовички часто совершают фатальную ошибку: они сохраняют важные данные прямо внутри контейнера.\nДавайте разберемся, почему так делать нельзя и что такое «эфемерность».\n\n## Эксперимент\n\n1. Запустим Ubuntu в интерактивном режиме (флаг **-it** позволяет «войти» внутрь контейнера):\n   ```\n   docker run -it ubuntu\n   ```\n2. Теперь мы внутри контейнера. Создадим файл с важными данными:\n   ```\n   echo \"My secret data\" > /important.txt\n   cat /important.txt\n   ```\n3. Выйдем из контейнера командой **exit**. Контейнер остановился.\n\nТеперь попробуем запустить Ubuntu снова:\n```\ndocker run -it ubuntu\ncat /important.txt\n```\n**Результат:** **cat: /important.txt: No such file or directory**. Файла нет!\n\n## Почему данные пропали?\n\nКаждый раз, когда вы пишете **docker run**, Docker создает **совершенно новый** контейнер из чистого образа. Это как распаковать новый ноутбук из коробки: на нем нет ваших файлов, только заводские настройки.\n\nДаже если вы запустите тот же самый остановленный контейнер (командой **docker start**), данные сохранятся. Но в мире Docker принято считать контейнеры **эфемерными** (временными).\nКонтейнеры легко удаляются, пересоздаются, переезжают на другие серверы.\n\n**Золотое правило:** Всё, что записано внутри файловой системы контейнера, может исчезнуть в любой момент (при обновлении версии, при сбое, при удалении контейнера).\n\n## Как хранить данные надежно?\n\nДля хранения данных, которые должны пережить перезапуск или удаление контейнера (базы данных, логи, загруженные файлы), используются **Volumes (Тома)** или **Bind Mounts**.\n\nЭто механизм, который говорит Docker: «Храни эту папку не внутри контейнера, а на моем реальном жестком диске».\n\nПример (пока просто для ознакомления):\n```\ndocker run -d -v my-db-data:/var/lib/mysql mysql\n```\nВ этом случае, даже если вы удалите контейнер с MySQL, данные останутся в томе **my-db-data**, и новый контейнер сможет их подхватить.\n\n## Итого\n\n- Контейнеры по своей природе **эфемерны**.\n- **docker run** создает новый чистый контейнер.\n- Не храните важные данные внутри контейнера без использования томов (Volumes). Мы подробно разберем работу с данными в отдельном модуле.\n"}